gluu-server/opt/dist/signincanada/saml/NIMRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP:Body>
    <samlp:NameIDMappingRequest xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
          IssueInstant="2009-04-01T10:23:11Z"
          Version="2.0"
          ID="a997c83a8d-b5d7-b930-edba-02e37ab1765" >
        <saml:Issuer>https://dev1-auth.id.alpha.canada.ca</saml:Issuer>
        <saml:NameID
            Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent"
            NameQualifier="https://cpsim1.catslab.ca" SPNameQualifier="https://dev1-auth.id.alpha.canada.ca">
            PsWVBRfNBw2LndX6Ti1N87V8RES9
        </saml:NameID>
        <samlp:NameIDPolicy
            Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" SPNameQualifier="https://dev2-auth.id.alpha.canada.ca">
        </samlp:NameIDPolicy>
    </samlp:NameIDMappingRequest>
</SOAP:Body>
</SOAP:Envelope>